app/Http/Controllers/Pages/CartPageController.php

    public function addToCart(Request $request)
    {
        $course_id = $request->get('course_id');
        $course_check = Cart::where('course_id', '=', $course_id)->where('user_id', '=', auth()->user()->id)->first();
        if(auth()->user())
        {
            if($course_check)
            {
                return redirect()->back()->with('fail', $course_check->course->course_name. ' Course'. ' Already Added to Cart ..!');
            } else {

            $cart = new Cart();
            $cart->user_id = auth()->user()->id;
            $cart->course_id = $request->course_id;
            $cart->instructor_id = $request->instructor_id;
            $cart->price = $request->price;
            $cart->save();
---
select * from `cart` where `course_id` = '2' and `user_id` = 1 limit 1
insert into `cart` (`user_id`, `course_id`, `instructor_id`, `price`, `updated_at`, `created_at`) values (1, '2', '1', '1000', '2022-11-17 19:19:17', '2022-11-17 19:19:17')

    static function cartList()
    {
        if(auth()->user()){
            $user = auth()->user()->id;
            $cart = Cart::where('user_id', '=', $user)->whereNull('order_id')->get();
            $count = Cart::where('user_id', $user)->count();
---
select * from `cart` where `user_id` = 1 and `order_id` is null
select count(*) as aggregate from `cart` where `user_id` = 1

    public function removeCartItem($id)
    {
        $isDeleted = Cart::destroy($id);
        if($isDeleted)
        {
            return redirect(route('viewCart'))->with('success', 'Deleted Successfully !');
---
delete from `cart` where `id` = 5
select * from `cart` where `id` in ('5')

    public function checkout()
    {
        $carts = Cart::where('user_id', Auth::id())->whereNull('order_id')->get();
---
select * from `cart` where `user_id` = 1 and `order_id` is null

    public function thanks()
    {
        $carts = Cart::where('user_id', Auth::id())->whereNull('order_id')->get();
        // return $carts;
        $amount = 0;
        foreach ($carts as $cart):
            $amount +=  round($cart->price,2);
        endforeach;
        $resourcePath = request()->resourcePath;

        $url = "https://eu-test.oppwa.com/$resourcePath";
        $url .= "?entityId=8a8294174b7ecb28014b9699220015ca";

        $ch = curl_init();
        curl_setopt($ch, CURLOPT_URL, $url);
        curl_setopt($ch, CURLOPT_HTTPHEADER, array(
                    'Authorization:Bearer OGE4Mjk0MTc0YjdlY2IyODAxNGI5Njk5MjIwMDE1Y2N8c3k2S0pzVDg='));
        curl_setopt($ch, CURLOPT_CUSTOMREQUEST, 'GET');
        curl_setopt($ch, CURLOPT_SSL_VERIFYPEER, false);// this should be set to true in production
        curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
        $responseData = curl_exec($ch);
        if(curl_errno($ch)) {
            return curl_error($ch);
        }
        curl_close($ch);
        $responseData = json_decode($responseData, true);
        // dd($responseData['result']['code']);

        if($responseData['result']['code'] == '000.100.110') {
            $order = Order::create(['total' => $amount, 'user_id' => Auth::id()]);
            Cart::where('user_id', Auth::id())->whereNull('order_id')->update(['order_id' => $order->id]);
---
select * from `cart` where `user_id` = 1 and `order_id` is null
insert into `orders` (`total`, `user_id`, `updated_at`, `created_at`) values (200, 1, '2022-11-17 12:21:34', '2022-11-17 12:21:34')
update `cart` set `order_id` = 6, `cart`.`updated_at` = '2022-11-17 12:21:34' where `user_id` = 1 and `order_id` is null

    public function checkout_installments(Request $request)
    {
            $time_installment = $request->installment;
            $user = auth()->user()->id;
            $cart = Cart::where('user_id', '=', $user)->whereNull('order_id')->first();
            $amount = 0;
            $totel = 0;
            if($cart){
            $count = Cart::where('user_id', $user)->count();
---
select * from `cart` where `user_id` = 1 and `order_id` is null limit 1
select count(*) as aggregate from `cart` where `user_id` = 1

    public function thanksInstallment(Request $request)
    {
        $user = auth()->user()->id;
        $data = Installment::where('user_id' , $user)->latest()->first();
        $amount = round($data->Paid,2);
        $resourcePath = request()->resourcePath;

        $url = "https://eu-test.oppwa.com/$resourcePath";
        $url .= "?entityId=8a8294174b7ecb28014b9699220015ca";

        $ch = curl_init();
        curl_setopt($ch, CURLOPT_URL, $url);
        curl_setopt($ch, CURLOPT_HTTPHEADER, array(
                    'Authorization:Bearer OGE4Mjk0MTc0YjdlY2IyODAxNGI5Njk5MjIwMDE1Y2N8c3k2S0pzVDg='));
        curl_setopt($ch, CURLOPT_CUSTOMREQUEST, 'GET');
        curl_setopt($ch, CURLOPT_SSL_VERIFYPEER, false);// this should be set to true in production
        curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
        $responseData = curl_exec($ch);
        if(curl_errno($ch)) {
            return curl_error($ch);
        }
        curl_close($ch);
        $responseData = json_decode($responseData, true);
        if($responseData['result']['code'] == '000.100.110') {
            $order = Order::create(['total' => $amount, 'user_id' => Auth::id()]);
            Cart::where('user_id', Auth::id())->whereNull('order_id')->update(['order_id' => $order->id]);
            CourseUser::create(['course_id' =>$data->course_id, 'user_id' => Auth::id() , 'status' => 1]);
---
select * from `installments` where `user_id` = 1 order by `created_at` desc limit 1
insert into `orders` (`total`, `user_id`, `updated_at`, `created_at`) values ('333', 1, '2022-11-17 20:54:19', '2022-11-17 20:54:19')
update `cart` set `order_id` = 16, `cart`.`updated_at` = '2022-11-17 20:54:19' where `user_id` = 1 and `order_id` is null
insert into `course_users` (`course_id`, `user_id`, `status`, `updated_at`, `created_at`) values (1, 1, 1, '2022-11-17 20:54:19', '2022-11-17 20:54:19')

            return redirect()->route('homeShow');
        }else {

            $data = Installment::where('user_id' , $user)->latest()->first();
---
select * from `installments` where `user_id` = 1 order by `created_at` desc limit 1