app/Http/Controllers/Pages/CategoryPageController.php

select `course_id` from `likes` where `user_id` = 1
select * from `categories` where `categories`.`id` = '1' limit 1
select * from `courses` where `courses`.`category_id` = 1 and `courses`.`category_id` is not null
---
    public function ShowCourseCategory($id){
        $category=Category::select(['category_name','id'])->get();
        $like=Like::where('user_id',Auth::id())->pluck('course_id')->toArray();

        $courses= Category::findOrFail($id)->courses;