app/Http/Controllers/Pages/CoursePageController.php

select * from `courses` where `courses`.`id` = '1' limit 1
select * from `courses` where `id` <> '1'
select * from `cart` where `user_id` = 1
select count(*) as aggregate from `cart` where `user_id` = 1
---
    public function show($id)
    {


        $course = Course::find($id);

        $courses = Course::where('id', '<>', $id)->get()->take(4);

        if(auth()->user()){
            $user = Auth::id();

            $cart = Cart::where('user_id', '=', $user)->get();

            $count = Cart::where('user_id', $user)->count();

select `course_id` from `likes` where `user_id` = 1
select * from `courses`
select * from `cart` where `user_id` = 1
select count(*) as aggregate from `cart` where `user_id` = 1
---
    public function all()
    {
        $like=Like::where('user_id',Auth::id())->pluck('course_id')->toArray();
        $courses = Course::all();
        if(auth()->user()){
            $user = auth()->user()->id;
            $cart = Cart::where('user_id', '=', $user)->get();
            $count = Cart::where('user_id', $user)->count();

select exists(select * from `likes` where `user_id` = 3 and `course_id` = '5') as `exists`
delete from `likes` where `user_id` = 3 and `course_id` = '5'
---
    public function postlike(Request $request){
        $course=Like::where('user_id',Auth::id())->where('course_id',$request->course)->exists();
        if(!$course) {
            Like::create([
                'user_id' => Auth::id(),
                'course_id' => $request->course
            ]);
        }else{
            $course=Like::where('user_id',Auth::id())->where('course_id',$request->course)->delete();