app/Http/Controllers/Pages/HomePageController.php

select * from `courses` order by `rate` desc limit 10
select * from `categories` order by `power` desc limit 3
select count(*) as aggregate from `courses`
select count(*) as aggregate from `users`
select count(*) as aggregate from `categories`
select * from `cart` where `user_id` = 1
select count(*) as aggregate from `cart` where `user_id` = 1
---
    public function show()
    {
        $courses = Course::latest('rate')->limit(10)->get();
        $categories = Category::latest('power')->limit(3)->get();
        $biography=biography::findOrFail(4);
        $biographyGroup=biography::limit(3)->get();
        $CountCourses = DB::table('courses')->count();
        $CountUsers = DB::table('users')->count();
        $CountCategories = DB::table('categories')->count();
      //  $users = DB::table('users')->count();
        $arr=[$CountCourses,$CountUsers,$CountCategories];

 if(auth()->user()){
            $user = auth()->user()->id;
            $cart = Cart::where('user_id', '=', $user)->get();
            $count = Cart::where('user_id', $user)->count();