app/View/Components/CartCourse.php

select * from `cart` where `user_id` = 1 and `order_id` is null
select count(*) as aggregate from `cart` where `user_id` = 1 and `order_id` is null
---
    public function __construct()
    {
        $this->cart=Cart::where('user_id', Auth::id())->whereNull('order_id')->get();
        $this->count=Cart::where('user_id', Auth::id())->whereNull('order_id')->count();