app/View/Components/likecourse.php

select `course_id` from `likes` where `user_id` = 1
select * from `courses` where `id` in (1)
---
    public function __construct()
    {
        $this->like=Like::where('user_id',Auth::id())->pluck('course_id')->toArray();
        $this->courses=Course::whereIn('id',$this->like)->get();