app/Http/Controllers/AuthController.php

    public function login(Request $request)
    {
        $validate = $request->validate([
            'email' => 'required|exists:users',
            'password' => 'required'
        ],[
            'email.required' => 'Email field is required',
            'email.exists' => 'Email doesn\'t exist',
            'password.required' => 'Password field is required',
            'password.min' => 'Password must be more than 3 characters',
            'password.max' => 'Password must be less than 30 characters',
        ]);

        // Login Code


        $user = User::where(['email' =>  $request->email])->first();
---
select * from `users` where (`email` = 'mohamed2562289mbn@gmail.com') limit 1