app/Http/Controllers/CategoryController.php

    public function index()
    {
        //
        $data = Category::all();
---
select * from `categories`