app/Http/Controllers/CourseController.php

select * from `courses`
select * from `categories`
select * from `instructors`
---
    public function index()
    {
        //

        if (Auth::guard('admin')->check()) {
            $courses = Course::all();
            $categories = Category::all();
            $instructors = Instructor::all();