app/Http/Controllers/LectureController.php

select * from `lectures` order by `created_at` desc
select * from `sections`
select * from `courses`
---
    public function index()
    {
        //
        $lectures = Lecture::all();
        $sections = Section::all();
        $courses = Course::all();

insert into `lectures` (`lecture_name`, `section_id`, `course_id`, `description`, `video`, `updated_at`, `created_at`) values ('Lunea Nash', '5', '1', 'Esse tenetur eum et', 'DpU9HObZMROAwEg3ioqxALRcpqNu4t.pexels-mue-ervive-718983.jpg', '2022-11-16 16:18:31', '2022-11-16 16:18:31')
---
    public function store(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'lecture_name' => 'required|string',
            'section_id' => 'required',
            'course_id' => 'required',
            'video' => 'required',
            'description' => 'required',
        ]);
        if ($validator->fails()) {
            toastr()->error('فشلت عملية الاضافة');
            return redirect()->back();
        } else {

            if ($video = $request->file('video')) {
                $newfile =  Str::random(30) . '.' . $video->getClientOriginalName();
                $Path = 'uploads/lecture/video';
                $video->move($Path, $newfile);
            }
            $course =  Lecture::create([
                'lecture_name' => $request->lecture_name,
                'section_id' => $request->section_id,
                'course_id' => $request->course_id,
                'description' => $request->description,
                'video' => $newfile,
            ]);

select `section_name`, `id` from `sections` where `course_id` = '2'
---
    public function getclasses($id)
    {
        $list_sections = Section::where("course_id", $id)->pluck("section_name", "id");