app/Http/Controllers/SectionController.php

    public function store(Request $request)
    {
        //
        $validator = Validator($request->all(), [
            'section_name' => 'required|string',
            'course_id' => 'required',
        ]);

        if (!$validator->fails()) {
            $section = new Section();
            $section->section_name = $request->section_name;
            $section->course_id = $request->course_id;
            $isSaved = $section->save();
---
insert into `sections` (`section_name`, `course_id`, `updated_at`, `created_at`) values ('Kellie Vasquez', '2', '2022-11-17 23:19:52', '2022-11-17 23:19:52')